99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx_public_session.c
#include "esp32_mquickjs_wifi_raw_tx.h"
#include "esp32_mquickjs_js_macros.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#include "esp32_mquickjs_wifi_raw_tx_session.h"
#include "esp32_mquickjs_wifi_radio.h"
#include "esp32_mquickjs_wifi.h"
#include "esp32_mquickjs_core.h"
#include "esp32_mquickjs_future.h"
#include "esp32_mquickjs_options.h"
#include "esp32_mquickjs_memory.h"
#include "esp_heap_caps.h"
#include <string.h>

typedef esp32_mquickjs_wifi_raw_tx_session_t native_session_t;
typedef esp32_mquickjs_wifi_raw_tx_session_status_t native_status_t;
typedef esp32_mquickjs_wifi_raw_tx_session_options_t session_options_t;
typedef esp32_mquickjs_wifi_raw_tx_payload_t payload_t;
typedef struct {
    /* JS task only; a close Future may outlive the JS finalizer. */
    uint32_t references;
    native_session_t *native;
    session_options_t options;
    native_status_t closed_status;
} session_handle_t;
typedef enum { SESSION_OPEN, SESSION_SEND, SESSION_FLUSH, SESSION_CLOSE, SESSION_WRITABLE } session_operation_t;
struct esp32_mquickjs_future_driver_state {
    session_operation_t operation;
    session_handle_t *handle;
    native_session_t *session;
    session_options_t options;
    uint32_t timeout_ms, minimum_packets, minimum_bytes;
    uint8_t *bytes;
    size_t length;
    esp_err_t error;
    const char *stage;
    esp32_mquickjs_wifi_raw_tx_validation_t validation;
    esp32_mquickjs_wifi_raw_tx_queue_result_t queue_result;
    bool started, cancelled, admitted;
    union {
        struct {
            esp32_mquickjs_wifi_raw_tx_result_record_t record;
            esp32_mquickjs_wifi_raw_tx_result_token_t token;
        } send;
        esp32_mquickjs_wifi_raw_tx_flush_token_t flush;
    } wait;
};

static const char *session_operation_name(session_operation_t operation)
{
    static const char *const names[] = {"wifi.rawTx.open", "WiFiRawTxSession.send", "WiFiRawTxSession.flush", "WiFiRawTxSession.close", "WiFiRawTxSession.waitWritable"};
    return names[operation];
}

static JSValue session_error(JSContext *ctx, const char *operation, const char *code,
    esp_err_t error, const char *stage, bool admitted, esp32_mquickjs_wifi_raw_tx_validation_t validation,
    esp32_mquickjs_wifi_raw_tx_queue_result_t queue_result)
{
    JSGCRef ref;
    JSValue *details = JS_PushGCRef(ctx, &ref);
    *details = JS_NewObject(ctx);
    if (JS_IsException(*details)) goto fail;
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, details, "espCode", JS_NewInt32(ctx, error), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, details, "espName", JS_NewString(ctx, esp_err_to_name(error)), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, details, "stage", stage ? JS_NewString(ctx, stage) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, details, "admitted", JS_NewBool(admitted), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, details, "validationCode", JS_NewUint32(ctx, validation), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, details, "queueCode", JS_NewUint32(ctx, queue_result), fail);
    (void)esp32_mquickjs_throw_native_error(ctx, code, operation,
        "Raw TX Session operation did not complete; admitted packets may still transmit", *details);
fail:
    JS_PopGCRef(ctx, &ref);
    return JS_EXCEPTION;
}

static session_handle_t *session_handle(JSContext *ctx, JSValue value)
{
    if (JS_GetClassID(ctx, value) != JS_CLASS_WIFI_RAW_TX_SESSION) {
        JS_ThrowTypeError(ctx, "expected WiFiRawTxSession"); return NULL;
    }
    session_handle_t *handle = JS_GetOpaque(ctx, value);
    if (handle == NULL) JS_ThrowReferenceError(ctx, "invalid WiFiRawTxSession");
    return handle;
}

bool esp32_mquickjs_wifi_raw_tx_session_capture_owner(JSContext *ctx, JSValue receiver,
    native_session_t **output, session_options_t *options)
{
    session_handle_t *handle = session_handle(ctx, receiver);
    if (handle == NULL) return false;
    if (handle->native == NULL) { JS_ThrowReferenceError(ctx, "WiFiRawTxSession is closed"); return false; }
    if (!esp32_mquickjs_wifi_raw_tx_session_retain(handle->native)) { JS_ThrowOutOfMemory(ctx); return false; }
    *output = handle->native;
    *options = handle->options;
    return true;
}

static bool handle_retain(session_handle_t *handle)
{
    if (handle == NULL || handle->references == 0U || handle->references == UINT32_MAX) return false;
    ++handle->references;
    return true;
}

static void handle_release(session_handle_t *handle)
{
    if (handle == NULL || --handle->references != 0U) return;
    if (handle->native != NULL) {
        esp32_mquickjs_wifi_raw_tx_session_request_close(handle->native);
        esp32_mquickjs_wifi_raw_tx_session_release(handle->native);
    }
    esp32_mquickjs_memory_payload_free(handle);
}

static bool handle_snapshot(session_handle_t *handle, native_status_t *snapshot)
{
    if (handle->native == NULL) { *snapshot = handle->closed_status; return true; }
    if (!esp32_mquickjs_wifi_raw_tx_session_status(handle->native, snapshot)) return false;
    if (snapshot->closed) {
        /* Preserve status without keeping the old native queue/registry owner.
         * Future result/flush registrations retain their own native references. */
        native_session_t *native = handle->native;
        handle->closed_status = *snapshot;
        handle->native = NULL;
        esp32_mquickjs_wifi_raw_tx_session_release(native);
    }
    return true;
}

void js_wifi_raw_tx_session_finalizer(JSContext *ctx, void *opaque)
{
    (void)ctx;
    session_handle_t *handle = opaque;
    if (handle == NULL) return;
    if (handle->native != NULL) esp32_mquickjs_wifi_raw_tx_session_request_close(handle->native);
    handle_release(handle);
}

JSValue js_wifi_raw_tx_session_constructor(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)this_val; (void)argc; (void)argv;
    return JS_ThrowTypeError(ctx, "use wifi.rawTx.open() to create a WiFiRawTxSession");
}

static bool capture_timeout(JSContext *ctx, JSValue value, uint32_t *timeout)
{
    *timeout = ESP32_MQUICKJS_WIFI_RAW_TX_DEFAULT_TIMEOUT_MS;
    if (JS_IsUndefined(value)) return true;
    if (esp32_mquickjs_value_to_bounded_u32(ctx, value, 1, INT32_MAX, timeout)) return true;
    JS_ThrowTypeError(ctx, "timeoutMs must be an integer from 1 to 2147483647");
    return false;
}

