99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx_public_session.c
static bool capture_send_options(JSContext *ctx, JSValue value, uint32_t *timeout)
{
    static const char *const keys[] = {"timeoutMs"};
    *timeout = ESP32_MQUICKJS_WIFI_RAW_TX_DEFAULT_TIMEOUT_MS;
    if (JS_IsUndefined(value)) return true;
    JSGCRef root_ref, field_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref), *field = JS_PushGCRef(ctx, &field_ref);
    *root = value;
    bool ok = esp32_mquickjs_validate_plain_options(ctx, *root, "WiFiRawTxSession.send", keys, 1);
    if (ok) {
        *field = JS_GetPropertyStr(ctx, *root, "timeoutMs");
        ok = !JS_IsException(*field) && capture_timeout(ctx, *field, timeout);
    }
    JS_PopGCRef(ctx, &field_ref); JS_PopGCRef(ctx, &root_ref);
    return ok;
}

static bool capture_open_options(JSContext *ctx, JSValue value, session_options_t *output, uint32_t *timeout)
{
    static const char *const keys[] = {"interface", "channel", "sequenceControl", "queue", "timeoutMs", "rate", "maxInFlight"};
    static const char *const interfaces[] = {"station", "access-point"};
    static const char *const sequences[] = {"driver", "application"};
    static const char *const current[] = {"current"};
    static const char *const queue_keys[] = {"capacityPackets", "overflow", "capacityBytes"};
    static const char *const overflows[] = {"reject-newest", "drop-oldest-batch"};
    session_options_t options = {.driver_sequence = true, .capacity = ESP32_MQUICKJS_WIFI_RAW_TX_DEFAULT_QUEUE_PACKETS};
    *timeout = ESP32_MQUICKJS_WIFI_RAW_TX_DEFAULT_TIMEOUT_MS;
    if (JS_IsUndefined(value)) { *output = options; return true; }
    JSGCRef root_ref, queue_ref, field_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref), *queue = JS_PushGCRef(ctx, &queue_ref);
    JSValue *field = JS_PushGCRef(ctx, &field_ref);
    *root = value;
    bool ok = false;
    uint32_t number;
    size_t choice;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "wifi.rawTx.open", keys, 7)) goto done;
    *field = JS_GetPropertyStr(ctx, *root, "interface");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *field, interfaces, 2, &choice)) goto invalid;
        options.interface = choice;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
        if (options.interface == ESP32_MQUICKJS_WIFI_RAW_TX_ACCESS_POINT) goto invalid;
#endif
    }
    *field = JS_GetPropertyStr(ctx, *root, "channel");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field)) {
        if (JS_IsString(ctx, *field)) {
            if (!esp32_mquickjs_value_to_enum(ctx, *field, current, 1, &choice)) goto invalid;
        } else {
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, 177, &number)) goto invalid;
            if (number > 14U) {
#if CONFIG_SOC_WIFI_SUPPORT_5G
                if (esp32_mquickjs_wifi_radio_5ghz_channel_bit(number) == 0U) goto invalid;
#else
                goto invalid;
#endif
            }
            options.channel = number;
        }
    }
    *field = JS_GetPropertyStr(ctx, *root, "sequenceControl");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field)) {
        if (!esp32_mquickjs_value_to_enum(ctx, *field, sequences, 2, &choice)) goto invalid;
        options.driver_sequence = choice == 0U;
    }
    *queue = JS_GetPropertyStr(ctx, *root, "queue");
    if (JS_IsException(*queue)) goto done;
    if (!JS_IsUndefined(*queue)) {
        if (!esp32_mquickjs_validate_plain_options(ctx, *queue, "wifi.rawTx.open.queue", queue_keys, 3)) goto done;
        *field = JS_GetPropertyStr(ctx, *queue, "capacityPackets");
        if (JS_IsException(*field)) goto done;
        if (!JS_IsUndefined(*field)) {
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_PACKETS, &number)) goto invalid;
            options.capacity = number;
        }
        *field = JS_GetPropertyStr(ctx, *queue, "capacityBytes");
        if (JS_IsException(*field)) goto done;
        if (!JS_IsUndefined(*field)) {
            if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, ESP32_MQUICKJS_WIFI_RAW_TX_MIN_FRAME_BYTES, (uint32_t)options.capacity * ESP32_MQUICKJS_WIFI_RAW_TX_MAX_FRAME_BYTES, &number)) goto invalid;
            options.capacity_bytes = number;
        }
        *field = JS_GetPropertyStr(ctx, *queue, "overflow");
        if (JS_IsException(*field)) goto done;
        if (!JS_IsUndefined(*field)) {
            if (!esp32_mquickjs_value_to_enum(ctx, *field, overflows, 2, &choice)) goto invalid;
            options.overflow = choice;
        }
    }
    *field = JS_GetPropertyStr(ctx, *root, "maxInFlight");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field)) {
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1,
            options.capacity < ESP32_MQUICKJS_WIFI_RAW_TX_MAX_IN_FLIGHT ? options.capacity : ESP32_MQUICKJS_WIFI_RAW_TX_MAX_IN_FLIGHT, &number)) goto invalid;
        options.max_in_flight = number;
    }
    *field = JS_GetPropertyStr(ctx, *root, "timeoutMs");
    if (JS_IsException(*field) || !capture_timeout(ctx, *field, timeout)) goto done;
    *field = JS_GetPropertyStr(ctx, *root, "rate");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field)) {
        if (!esp32_mquickjs_wifi_tx_rate_capture(ctx, *field, &options.rate)) goto done;
        options.rate_set = true;
    }
    *output = options; ok = true; goto done;
invalid:
    JS_ThrowTypeError(ctx, "invalid wifi.rawTx.open options");
done:
    JS_PopGCRef(ctx, &field_ref); JS_PopGCRef(ctx, &queue_ref); JS_PopGCRef(ctx, &root_ref);
    return ok;
}

/* Waiting observes capacity; it never reserves slots or changes queued work. */
static bool capture_writable_options(JSContext *ctx, JSValue value,
    esp32_mquickjs_future_driver_state_t *state)
{
    static const char *const keys[] = {"minimumPackets", "minimumBytes", "timeoutMs"};
    state->minimum_packets = 1;
    state->minimum_bytes = ESP32_MQUICKJS_WIFI_RAW_TX_MIN_FRAME_BYTES;
    if (JS_IsUndefined(value)) return true;
    JSGCRef root_ref, field_ref;
    JSValue *root = JS_PushGCRef(ctx, &root_ref), *field = JS_PushGCRef(ctx, &field_ref);
    *root = value;
    bool ok = false;
    if (!esp32_mquickjs_validate_plain_options(ctx, *root, "WiFiRawTxSession.waitWritable", keys, 3)) goto done;
    *field = JS_GetPropertyStr(ctx, *root, "minimumPackets");
    if (JS_IsException(*field)) goto done;
    if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1,
        state->options.capacity, &state->minimum_packets)) goto invalid;
    state->minimum_bytes = state->minimum_packets * ESP32_MQUICKJS_WIFI_RAW_TX_MIN_FRAME_BYTES;
    *field = JS_GetPropertyStr(ctx, *root, "minimumBytes");
    if (JS_IsException(*field)) goto done;
    uint32_t capacity_bytes = state->options.capacity_bytes ? state->options.capacity_bytes : (uint32_t)state->options.capacity * ESP32_MQUICKJS_WIFI_RAW_TX_MAX_FRAME_BYTES;
    if (!JS_IsUndefined(*field) && !esp32_mquickjs_value_to_bounded_u32(ctx, *field, 0,
        capacity_bytes, &state->minimum_bytes)) goto invalid;
    if (state->minimum_bytes > capacity_bytes) goto invalid;
    *field = JS_GetPropertyStr(ctx, *root, "timeoutMs");
    if (JS_IsException(*field) || !capture_timeout(ctx, *field, &state->timeout_ms)) goto done;
    ok = true; goto done;
invalid:
    JS_ThrowTypeError(ctx, "invalid WiFiRawTxSession.waitWritable capacity");
done:
    JS_PopGCRef(ctx, &field_ref); JS_PopGCRef(ctx, &root_ref);
    return ok;
}

static void session_future_destroy(esp32_mquickjs_future_driver_state_t *state)
{
    if (state == NULL) return;
    if (state->operation == SESSION_SEND && state->wait.send.token.identity != 0U) {
        /* No SDK ever receives this record pointer. Failure must preserve the
         * registered storage rather than free memory still visible to Session. */
        if (!esp32_mquickjs_wifi_raw_tx_session_result_release(state->session, &state->wait.send.token)) return;
    }
    if (state->operation == SESSION_FLUSH && state->wait.flush.identity != 0U) {
        if (!esp32_mquickjs_wifi_raw_tx_session_flush_release(state->session, &state->wait.flush)) return;
    }
    if (state->session != NULL) {
        if (state->operation == SESSION_OPEN) esp32_mquickjs_wifi_raw_tx_session_request_close(state->session);
        esp32_mquickjs_wifi_raw_tx_session_release(state->session);
    }
    handle_release(state->handle);
    esp32_mquickjs_memory_payload_free(state->bytes);
    esp32_mquickjs_memory_payload_free(state);
}

static bool session_capture(JSContext *ctx, JSGCRef *receiver, int argc, JSGCRef *argv,
    esp32_mquickjs_future_driver_state_t **output, session_operation_t operation)
{
    *output = NULL;
    bool valid_args = operation == SESSION_SEND ? argc >= 1 && argc <= 2 :
        operation == SESSION_CLOSE ? argc == 0 : argc >= 0 && argc <= 1;
    if (!valid_args) { JS_ThrowTypeError(ctx, "invalid Raw TX Session argument count"); return false; }
    esp32_mquickjs_future_driver_state_t *state = esp32_mquickjs_memory_wireless_calloc(
        "wireless.future", 1, sizeof(*state), ESP32_MQUICKJS_MEMORY_DEFAULT,
        ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
    if (state == NULL) { JS_ThrowOutOfMemory(ctx); return false; }
    state->operation = operation; state->timeout_ms = ESP32_MQUICKJS_WIFI_RAW_TX_DEFAULT_TIMEOUT_MS;
    if (operation == SESSION_OPEN) {
        if (!capture_open_options(ctx, argc ? argv[0].val : JS_UNDEFINED, &state->options, &state->timeout_ms)) goto fail;
        state->handle = esp32_mquickjs_memory_wireless_calloc("wifi.raw-tx", 1, sizeof(*state->handle), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_CONTROL);
        if (state->handle == NULL) { JS_ThrowOutOfMemory(ctx); goto fail; }
        state->handle->references = 1;
        state->handle->options = state->options;
    } else {
        session_handle_t *handle = session_handle(ctx, receiver->val);
        if (handle == NULL) goto fail;
        if (operation == SESSION_CLOSE) {
            if (!handle_retain(handle)) { JS_ThrowOutOfMemory(ctx); goto fail; }
            state->handle = handle;
        }
        if (handle->native == NULL && operation != SESSION_CLOSE) {
            JS_ThrowReferenceError(ctx, "WiFiRawTxSession is closed"); goto fail;
        }
        if (handle->native != NULL) {
            if (!esp32_mquickjs_wifi_raw_tx_session_retain(handle->native)) { JS_ThrowOutOfMemory(ctx); goto fail; }
            state->session = handle->native;
        }
        state->options = handle->options;
        if (operation == SESSION_SEND) {
            if (!capture_send_options(ctx, argc > 1 ? argv[1].val : JS_UNDEFINED, &state->timeout_ms) ||
                !esp32_mquickjs_wifi_raw_tx_capture_bytes(ctx, &argv[0], session_operation_name(operation), &state->bytes, &state->length)) goto fail;
            esp32_mquickjs_wifi_raw_tx_validation_policy_t policy = {.interface = state->options.interface, .driver_sequence = state->options.driver_sequence};
            esp32_mquickjs_wifi_raw_tx_validated_frame_t frame;
            state->validation = esp32_mquickjs_wifi_raw_tx_validate(state->bytes, state->length, &policy, &frame);
            if (state->validation != ESP32_MQUICKJS_WIFI_RAW_TX_VALID) {
                session_error(ctx, session_operation_name(operation), "WIFI_RAW_TX_INVALID_FRAME", ESP_ERR_INVALID_ARG,
                    "capture", false, state->validation, ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_INVALID); goto fail;
            }
        } else if (operation == SESSION_WRITABLE) {
            if (!capture_writable_options(ctx, argc ? argv[0].val : JS_UNDEFINED, state)) goto fail;
        } else if (operation == SESSION_FLUSH && !capture_timeout(ctx, argc ? argv[0].val : JS_UNDEFINED, &state->timeout_ms)) goto fail;
    }
    *output = state; return true;
fail:
    session_future_destroy(state);
    return false;
}

#define CAPTURE(name, operation) \
static bool name(JSContext *ctx, JSGCRef *receiver, int argc, JSGCRef *argv, esp32_mquickjs_future_driver_state_t **output) \
{ return session_capture(ctx, receiver, argc, argv, output, operation); }
CAPTURE(session_open_capture, SESSION_OPEN)
CAPTURE(session_send_capture, SESSION_SEND)
CAPTURE(session_flush_capture, SESSION_FLUSH)
CAPTURE(session_close_capture, SESSION_CLOSE)
CAPTURE(session_writable_capture, SESSION_WRITABLE)

static bool session_future_start(JSContext *ctx, esp32_mquickjs_runtime_t *runtime,
    esp32_mquickjs_future_token_t token, esp32_mquickjs_future_driver_state_t *state)
{
    (void)ctx; (void)runtime; (void)token;
    if (state->cancelled) return true;
    state->started = true;
    if (state->operation == SESSION_OPEN) {
        state->error = esp32_mquickjs_wifi_raw_tx_session_new(&state->options, &state->session);
        state->stage = "session-create";
    } else if (state->operation == SESSION_CLOSE) {
        if (state->session != NULL) esp32_mquickjs_wifi_raw_tx_session_request_close(state->session);
    } else if (state->operation == SESSION_FLUSH) {
        state->queue_result = esp32_mquickjs_wifi_raw_tx_session_flush_begin(state->session, &state->wait.flush);
        state->stage = "flush-admission";
    } else if (state->operation == SESSION_SEND) {
        payload_t frame = {state->bytes, (uint16_t)state->length};
        payload_t removed[ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_MAX_PACKETS] = {0};
        esp32_mquickjs_wifi_raw_tx_admission_t admission;
        state->queue_result = esp32_mquickjs_wifi_raw_tx_session_admit_result(state->session, &frame,
            removed, state->options.capacity, &admission, &state->validation, &state->wait.send.record, &state->wait.send.token);
        if (state->queue_result == ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_OK) {
            state->bytes = NULL; state->length = 0; state->admitted = true;
            for (unsigned i = 0; i < admission.evicted_packets; ++i) esp32_mquickjs_memory_payload_free(removed[i].data);
        }
        state->stage = "send-admission";
    }
    if (state->queue_result != ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_OK) state->error = ESP_ERR_INVALID_STATE;
    (void)esp32_mquickjs_wifi_raw_tx_sessions_service();
    return true;
}

