99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx_public_session.c
static esp32_mquickjs_future_poll_t session_future_poll(esp32_mquickjs_future_driver_state_t *state)
{
    (void)esp32_mquickjs_wifi_raw_tx_sessions_service();
    if (state->cancelled || state->error != ESP_OK) return ESP32_MQUICKJS_FUTURE_READY;
    if (!state->started) return ESP32_MQUICKJS_FUTURE_PENDING;
    bool ready = false, valid = true;
    if (state->operation == SESSION_OPEN || state->operation == SESSION_CLOSE) {
        native_status_t status = {0};
        if (state->session == NULL) ready = true;
        else if (!(valid = esp32_mquickjs_wifi_raw_tx_session_status(state->session, &status))) ready = true;
        else ready = state->operation == SESSION_OPEN ? status.open_complete || status.faulted || status.close_requested : status.closed;
    } else if (state->operation == SESSION_WRITABLE) {
        native_status_t status = {0};
        valid = esp32_mquickjs_wifi_raw_tx_session_status(state->session, &status);
        if (valid && (status.closed || status.close_requested || status.faulted)) {
            state->error = ESP_ERR_INVALID_STATE; state->stage = "queue-closed"; ready = true;
        } else if (valid && state->minimum_packets > status.remaining_sequences) {
            state->error = ESP_ERR_INVALID_STATE; state->stage = "queue-identity-exhausted"; ready = true;
        } else if (valid) ready = status.open_complete &&
            (uint32_t)(status.capacity - status.queued - status.in_flight) >= state->minimum_packets &&
            status.capacity_bytes - status.used_bytes >= state->minimum_bytes;
    } else if (state->operation == SESSION_SEND) {
        esp32_mquickjs_wifi_raw_tx_result_t result;
        valid = esp32_mquickjs_wifi_raw_tx_session_result_status(state->session, &state->wait.send.token, &result);
        ready = valid && result.kind != ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_PENDING;
    } else {
        esp32_mquickjs_wifi_raw_tx_flush_status_t result;
        valid = esp32_mquickjs_wifi_raw_tx_session_flush_status(state->session, &state->wait.flush, &result);
        ready = valid && result.pending == 0U;
    }
    if (!valid) { state->error = ESP_ERR_INVALID_STATE; state->stage = "wait-identity"; ready = true; }
    return ready ? ESP32_MQUICKJS_FUTURE_READY : ESP32_MQUICKJS_FUTURE_PENDING;
}

static JSValue totals_to_js(JSContext *ctx, const esp32_mquickjs_wifi_raw_tx_queue_totals_t *totals)
{
    JSGCRef ref; JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx); if (JS_IsException(*result)) goto fail;
#define TOTAL(name) ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, #name, JS_NewUint32(ctx, totals->name), fail)
    TOTAL(admitted); TOTAL(submitted); TOTAL(settled); TOTAL(succeeded); TOTAL(failed);
    TOTAL(unknown); TOTAL(rejected); TOTAL(aborted); TOTAL(dropped);
#undef TOTAL
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

static JSValue session_future_finish(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state)
{
    if (state->error != ESP_OK) return session_error(ctx, session_operation_name(state->operation), "WIFI_RAW_TX_SESSION_FAILED",
        state->error, state->stage, state->admitted, state->validation, state->queue_result);
    if (state->operation == SESSION_WRITABLE) return JS_UNDEFINED;
    if (state->operation == SESSION_CLOSE) {
        native_status_t status = {0};
        if (!handle_snapshot(state->handle, &status) || !status.closed)
            return session_error(ctx, session_operation_name(state->operation), "WIFI_RAW_TX_SESSION_FAILED", ESP_ERR_INVALID_STATE,
                "close-state", false, state->validation, state->queue_result);
        return JS_UNDEFINED;
    }
    if (state->operation == SESSION_OPEN) {
        native_status_t status = {0};
        if (!esp32_mquickjs_wifi_raw_tx_session_status(state->session, &status) || !status.open_complete || status.faulted || status.close_requested)
            return session_error(ctx, "wifi.rawTx.open", "WIFI_RAW_TX_SESSION_FAILED", status.error ? status.error : ESP_ERR_INVALID_STATE,
                status.stage ? status.stage : "open-state", false, state->validation, state->queue_result);
        JSValue object = JS_NewObjectClassUser(ctx, JS_CLASS_WIFI_RAW_TX_SESSION);
        if (JS_IsException(object)) return JS_EXCEPTION;
        state->handle->native = state->session; state->session = NULL;
        JS_SetOpaque(ctx, object, state->handle); state->handle = NULL;
        return object;
    }
    JSGCRef ref; JSValue *result = JS_PushGCRef(ctx, &ref);
    if (state->operation == SESSION_SEND) {
        esp32_mquickjs_wifi_raw_tx_result_t snapshot;
        if (!esp32_mquickjs_wifi_raw_tx_session_result_status(state->session, &state->wait.send.token, &snapshot)) goto stale;
        if (snapshot.kind != ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_COMPLETED) {
            session_error(ctx, "WiFiRawTxSession.send", snapshot.kind == ESP32_MQUICKJS_WIFI_RAW_TX_RESULT_UNCERTAIN
                ? "WIFI_RAW_TX_UNCERTAIN" : "WIFI_RAW_TX_SESSION_FAILED", snapshot.error ? snapshot.error : ESP_ERR_INVALID_STATE,
                snapshot.stage, true, state->validation, state->queue_result); goto fail;
        }
        *result = esp32_mquickjs_wifi_raw_tx_result_to_js(ctx, &snapshot.native, state->options.interface, snapshot.channel);
        if (JS_IsException(*result)) goto fail;
        ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sessionGeneration", JS_NewUint32(ctx, snapshot.generation), fail);
        ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "admissionSequence", JS_NewUint32(ctx, snapshot.sequence), fail);
    } else {
        esp32_mquickjs_wifi_raw_tx_flush_status_t snapshot;
        if (!esp32_mquickjs_wifi_raw_tx_session_flush_status(state->session, &state->wait.flush, &snapshot)) goto stale;
        *result = totals_to_js(ctx, &snapshot.totals); if (JS_IsException(*result)) goto fail;
        ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sessionGeneration", JS_NewUint32(ctx, snapshot.generation), fail);
        ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "throughSequence", JS_NewUint32(ctx, snapshot.fence), fail);
        ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "pending", JS_NewUint32(ctx, snapshot.pending), fail);
    }
    return JS_PopGCRef(ctx, &ref);
stale:
    session_error(ctx, session_operation_name(state->operation), "WIFI_RAW_TX_SESSION_FAILED", ESP_ERR_INVALID_STATE,
        "result-identity", state->admitted, state->validation, state->queue_result);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

static esp32_mquickjs_cancel_result_t session_future_cancel(esp32_mquickjs_future_driver_state_t *state)
{
    state->cancelled = true;
    if (state->operation == SESSION_OPEN && state->session != NULL) esp32_mquickjs_wifi_raw_tx_session_request_close(state->session);
    return ESP32_MQUICKJS_CANCELLED;
}
static uint32_t session_future_timeout(const esp32_mquickjs_future_driver_state_t *state)
{
    return state->timeout_ms;
}
static void session_future_expire(esp32_mquickjs_future_driver_state_t *state)
{
    /* A close deadline must retain close intent even if the Future submission
     * queue has not dispatched start yet. Explicit cancel-before-start can still
     * withdraw that intent; a timeout is not an instruction to keep Radio open. */
    if (state->operation == SESSION_CLOSE && state->session != NULL)
        esp32_mquickjs_wifi_raw_tx_session_request_close(state->session);
    (void)session_future_cancel(state);
}
static JSValue session_future_on_timeout(JSContext *ctx, esp32_mquickjs_future_driver_state_t *state, uint32_t timeout)
{
    (void)timeout;
    session_future_expire(state);
    return session_error(ctx, session_operation_name(state->operation), "WIFI_RAW_TX_TIMEOUT", ESP_ERR_TIMEOUT,
        "deadline", state->admitted, state->validation, state->queue_result);
}
#define DRIVER(capture_name) { .memory_owner = "wireless.future", .capture = capture_name, .start = session_future_start, .poll = session_future_poll, \
    .finish = session_future_finish, .cancel = session_future_cancel, .destroy = session_future_destroy, \
    .timeout_ms = session_future_timeout, .on_timeout = session_future_on_timeout }
static const esp32_mquickjs_future_driver_t s_open_driver = DRIVER(session_open_capture);
static const esp32_mquickjs_future_driver_t s_send_driver = DRIVER(session_send_capture);
static const esp32_mquickjs_future_driver_t s_flush_driver = DRIVER(session_flush_capture);
static const esp32_mquickjs_future_driver_t s_close_driver = DRIVER(session_close_capture);
static const esp32_mquickjs_future_driver_t s_writable_driver = DRIVER(session_writable_capture);

static JSValue session_wait_call(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv, session_operation_t operation)
{
    JSGCRef receiver_ref, owner_ref, method_ref;
    JSValue *receiver = JS_PushGCRef(ctx, &receiver_ref), *owner = JS_PushGCRef(ctx, &owner_ref);
    JSValue *method = JS_PushGCRef(ctx, &method_ref);
    *receiver = this_val ? *this_val : JS_UNDEFINED;
    *owner = JS_GetGlobalObject(ctx);
    if (operation == SESSION_OPEN) {
        *owner = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, "wifi");
        *owner = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, "rawTx");
        *receiver = *owner;
    } else {
        *owner = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, "WiFiRawTxSession");
        *owner = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, "prototype");
    }
    static const char *const methods[] = {"open", "send", "flush", "close", "waitWritable"};
    *method = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, methods[operation]);
    JSValue result = JS_IsException(*method) ? JS_EXCEPTION : esp32_mquickjs_future_call_and_wait(ctx,
        esp32_mquickjs_get_active_runtime(), *method, *receiver, argc, argv);
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &owner_ref); JS_PopGCRef(ctx, &receiver_ref);
    return result;
}
JSValue js_wifi_raw_tx_open(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return session_wait_call(ctx, this_val, argc, argv, SESSION_OPEN); }
JSValue js_wifi_raw_tx_session_send(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return session_wait_call(ctx, this_val, argc, argv, SESSION_SEND); }
JSValue js_wifi_raw_tx_session_flush(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return session_wait_call(ctx, this_val, argc, argv, SESSION_FLUSH); }
JSValue js_wifi_raw_tx_session_close(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return session_wait_call(ctx, this_val, argc, argv, SESSION_CLOSE); }

JSValue js_wifi_raw_tx_session_wait_writable(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return session_wait_call(ctx, this_val, argc, argv, SESSION_WRITABLE); }

static JSValue admission_to_js(JSContext *ctx, const esp32_mquickjs_wifi_raw_tx_admission_t *admission)
{
    JSGCRef ref; JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx); if (JS_IsException(*result)) goto fail;
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sessionGeneration", JS_NewUint32(ctx, admission->generation), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "firstSequence", JS_NewUint32(ctx, admission->first_sequence), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "lastSequence", JS_NewUint32(ctx, admission->last_sequence), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "batchSequence", JS_NewUint32(ctx, admission->batch_sequence), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "admittedPackets", JS_NewUint32(ctx, admission->admitted_packets), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "evictedPackets", JS_NewUint32(ctx, admission->evicted_packets), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "evictedBatches", JS_NewUint32(ctx, admission->evicted_batches), fail);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

