99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_raw_tx/esp32_mquickjs_wifi_raw_tx_public_session.c
static JSValue session_enqueue(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv, bool batch)
{
    if (argc != 1 || this_val == NULL) return JS_ThrowTypeError(ctx, "Raw TX enqueue expects one frame or frame collection");
    JSGCRef self_ref, input_ref, field_ref, result_ref;
    JSValue *self = JS_PushGCRef(ctx, &self_ref), *input = JS_PushGCRef(ctx, &input_ref);
    JSValue *field = JS_PushGCRef(ctx, &field_ref), *result = JS_PushGCRef(ctx, &result_ref);
    *self = *this_val; *input = argv[0]; *result = JS_EXCEPTION;
    native_session_t *native = NULL;
    payload_t *frames = NULL, *removed = NULL;
    uint32_t count = 1, capacity = 0;
    session_handle_t *handle = session_handle(ctx, *self);
    if (handle == NULL) goto done;
    if (handle->native == NULL) { JS_ThrowReferenceError(ctx, "WiFiRawTxSession is closed"); goto done; }
    if (!esp32_mquickjs_wifi_raw_tx_session_retain(handle->native)) { JS_ThrowOutOfMemory(ctx); goto done; }
    native = handle->native;
    capacity = handle->options.capacity;
    const char *operation = batch ? "WiFiRawTxSession.enqueueBatch" : "WiFiRawTxSession.enqueue";
    if (batch) {
        if (JS_GetClassID(ctx, *input) < 0) { JS_ThrowTypeError(ctx, "enqueueBatch expects an ArrayLike of frames"); goto done; }
        *field = JS_GetPropertyStr(ctx, *input, "length");
        if (JS_IsException(*field)) goto done;
        if (!esp32_mquickjs_value_to_bounded_u32(ctx, *field, 1, capacity, &count)) {
            JS_ThrowTypeError(ctx, "batch length must be within the Session queue capacity"); goto done;
        }
    }
    frames = esp32_mquickjs_memory_wireless_calloc("wifi.raw-tx", count, sizeof(*frames), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_COPY);
    removed = esp32_mquickjs_memory_wireless_calloc("wifi.raw-tx", capacity, sizeof(*removed), ESP32_MQUICKJS_MEMORY_DEFAULT, ESP32_MQUICKJS_MEMORY_BUDGET_COPY);
    if (frames == NULL || removed == NULL) { JS_ThrowOutOfMemory(ctx); goto done; }
    for (uint32_t i = 0; i < count; ++i) {
        *field = batch ? JS_GetPropertyUint32(ctx, *input, i) : *input;
        if (JS_IsException(*field)) goto done;
        size_t length = 0;
        if (!esp32_mquickjs_wifi_raw_tx_capture_bytes(ctx, &field_ref, operation, &frames[i].data, &length)) goto done;
        frames[i].length = (uint16_t)length;
    }
    esp32_mquickjs_wifi_raw_tx_admission_t admission;
    esp32_mquickjs_wifi_raw_tx_validation_t validation;
    esp32_mquickjs_wifi_raw_tx_queue_result_t admitted = esp32_mquickjs_wifi_raw_tx_session_admit(
        native, frames, (uint16_t)count, removed, (uint16_t)capacity, &admission, &validation);
    if (admitted != ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_OK) {
        session_error(ctx, operation, validation != ESP32_MQUICKJS_WIFI_RAW_TX_VALID ? "WIFI_RAW_TX_INVALID_FRAME" : "WIFI_RAW_TX_ADMISSION_FAILED",
            admitted == ESP32_MQUICKJS_WIFI_RAW_TX_QUEUE_INVALID ? ESP_ERR_INVALID_ARG : ESP_ERR_INVALID_STATE,
            "queue-admission", false, validation, admitted); goto done;
    }
    /* Admission has happened. A result-construction exception cannot undo it. */
    *result = admission_to_js(ctx, &admission);
    (void)esp32_mquickjs_wifi_raw_tx_sessions_service();
done:
    if (frames != NULL) for (uint32_t i = 0; i < count; ++i) esp32_mquickjs_memory_payload_free(frames[i].data);
    if (removed != NULL) for (uint32_t i = 0; i < capacity; ++i) esp32_mquickjs_memory_payload_free(removed[i].data);
    esp32_mquickjs_memory_payload_free(frames); esp32_mquickjs_memory_payload_free(removed);
    esp32_mquickjs_wifi_raw_tx_session_release(native);
    JSValue value = JS_PopGCRef(ctx, &result_ref);
    JS_PopGCRef(ctx, &field_ref); JS_PopGCRef(ctx, &input_ref); JS_PopGCRef(ctx, &self_ref);
    return value;
}
JSValue js_wifi_raw_tx_session_enqueue(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return session_enqueue(ctx, this_val, argc, argv, false); }
JSValue js_wifi_raw_tx_session_enqueue_batch(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{ return session_enqueue(ctx, this_val, argc, argv, true); }

JSValue js_wifi_raw_tx_session_status(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argv;
    if (argc != 0 || this_val == NULL) return JS_ThrowTypeError(ctx, "WiFiRawTxSession.status expects no arguments");
    session_handle_t *handle = session_handle(ctx, *this_val);
    native_status_t status;
    if (handle == NULL) return JS_EXCEPTION;
    if (!handle_snapshot(handle, &status)) return JS_ThrowInternalError(ctx, "Raw TX status unavailable");
    /* No handle/native pointer is accessed after the first JS allocation. */
    session_options_t options = handle->options;
    JSGCRef ref; JSValue *result = JS_PushGCRef(ctx, &ref);
    *result = JS_NewObject(ctx); if (JS_IsException(*result)) goto fail;
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "state", JS_NewString(ctx, status.closed ? "closed" : status.faulted ? "faulted" : status.close_requested ? "closing" : "open"), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sessionGeneration", JS_NewUint32(ctx, status.generation), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "radioGeneration", status.radio_generation ? JS_NewUint32(ctx, status.radio_generation) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "interface", JS_NewString(ctx, options.interface == ESP32_MQUICKJS_WIFI_RAW_TX_STATION ? "station" : "access-point"), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "channel", status.channel ? JS_NewUint32(ctx, status.channel) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "sequenceControl", JS_NewString(ctx, options.driver_sequence ? "driver" : "application"), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "capacityPackets", JS_NewUint32(ctx, status.capacity), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "capacityBytes", JS_NewUint32(ctx, status.capacity_bytes), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "usedBytes", JS_NewUint32(ctx, status.used_bytes), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "availableBytes", JS_NewUint32(ctx, status.capacity_bytes - status.used_bytes), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "availablePackets", JS_NewUint32(ctx, status.capacity - status.queued - status.in_flight), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "highWaterBytes", JS_NewUint32(ctx, status.high_water_bytes), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "inFlight", JS_NewUint32(ctx, status.in_flight), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "maxInFlight", JS_NewUint32(ctx, status.max_in_flight), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "queuedPackets", JS_NewUint32(ctx, status.queued), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "pendingPackets", JS_NewUint32(ctx, status.totals.admitted - status.totals.settled), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "activeSequence", status.active_sequence ? JS_NewUint32(ctx, status.active_sequence) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "requestIdentity", status.lane_identity ? JS_NewUint32(ctx, status.lane_identity) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "workerBusy", JS_NewBool(status.worker_busy), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "periodicJobs", JS_NewUint32(ctx, status.periodic_children), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "faulted", JS_NewBool(status.faulted), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "cleanupPending", JS_NewBool(status.close_requested && !status.closed), fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "error", status.error ? JS_NewInt32(ctx, status.error) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "stage", status.stage ? JS_NewString(ctx, status.stage) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "cleanupError", status.cleanup_error ? JS_NewInt32(ctx, status.cleanup_error) : JS_NULL, fail);
    ESP32_MQUICKJS_SET_OR_GOTO(ctx, result, "cleanupStage", status.cleanup_stage ? JS_NewString(ctx, status.cleanup_stage) : JS_NULL, fail);
    return JS_PopGCRef(ctx, &ref);
fail:
    JS_PopGCRef(ctx, &ref); return JS_EXCEPTION;
}

JSValue js_wifi_raw_tx_session_stats(JSContext *ctx, JSValue *this_val, int argc, JSValue *argv)
{
    (void)argv;
    if (argc != 0 || this_val == NULL) return JS_ThrowTypeError(ctx, "WiFiRawTxSession.stats expects no arguments");
    session_handle_t *handle = session_handle(ctx, *this_val);
    native_status_t status;
    if (handle == NULL) return JS_EXCEPTION;
    if (!handle_snapshot(handle, &status)) return JS_ThrowInternalError(ctx, "Raw TX stats unavailable");
    return totals_to_js(ctx, &status.totals);
}

bool esp32_mquickjs_init_wifi_raw_tx_session_runtime(JSContext *ctx, esp32_mquickjs_runtime_t *runtime)
{
    JSGCRef owner_ref, method_ref;
    JSValue *owner = JS_PushGCRef(ctx, &owner_ref), *method = JS_PushGCRef(ctx, &method_ref);
    bool ok = false;
    *owner = JS_GetGlobalObject(ctx);
    *owner = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, "wifi");
    *owner = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, "rawTx");
    *method = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, "open");
    if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, &s_open_driver)) goto done;
    *owner = JS_GetGlobalObject(ctx);
    *owner = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, "WiFiRawTxSession");
    *owner = JS_IsException(*owner) ? JS_EXCEPTION : JS_GetPropertyStr(ctx, *owner, "prototype");
    if (JS_IsException(*owner)) goto done;
    static const char *const methods[] = {"send", "flush", "close", "waitWritable"};
    static const esp32_mquickjs_future_driver_t *const drivers[] = {&s_send_driver, &s_flush_driver, &s_close_driver, &s_writable_driver};
    for (unsigned i = 0; i < 4; ++i) {
        *method = JS_GetPropertyStr(ctx, *owner, methods[i]);
        if (JS_IsException(*method) || !esp32_mquickjs_future_register_driver(ctx, runtime, *method, drivers[i])) goto done;
    }
    ok = true;
done:
    if (!ok && !JS_HasException(ctx)) JS_ThrowInternalError(ctx, "failed to register Raw TX Session drivers");
    JS_PopGCRef(ctx, &method_ref); JS_PopGCRef(ctx, &owner_ref);
    return ok;
}
#endif
